
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.slack_alerts_monitoring_reader[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.slack_alerts_monitoring_reader[0] must be replaced
-/+ resource "azurerm_role_assignment" "slack_alerts_monitoring_reader" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod/providers/Microsoft.Authorization/roleAssignments/2b6ee40b-5dbd-fa5d-6a0b-a68bbb988965" -> (known after apply)
      ~ name                                   = "2b6ee40b-5dbd-fa5d-6a0b-a68bbb988965" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> (known after apply)
      ~ scope                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.Insights/components/et-prod" -> "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod" # forces replacement
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":131,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->